In [2]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Salary': [10000,20000,50000]})

In [3]:
def add_bonus(df):
    df['Salary'] = df['Salary'] + 1000
    return df

In [4]:
df.pipe(add_bonus)

   Salary
0   11000
1   21000
2   51000

In [11]:
df1 = pd.DataFrame({'Basic':[10000,15000,25000]})

In [8]:
def add_increment(df1):
    df1['Basic'] = df1['Basic'] + 5000
    return df1

In [12]:
df1.pipe(lambda x:x+5000)

   Basic
0  15000
1  20000
2  30000

In [22]:
data_set = {
    'sample_set1':[3,4,5,6],
    'sample_set2':[5,3,7,2]
}

In [23]:
df_sample = pd.DataFrame(data_set)

In [26]:
print(df_sample.apply(sum, axis=1))

0     8
1     7
2    12
3     8
dtype: int64

In [30]:
print(df_sample.map(lambda x:x+1))

   sample_set1  sample_set2
0            4            6
1            5            4
2            6            8
3            7            3

In [3]:
hr_data = pd.read_csv("WA_Fn-UseC_-HR-Employee-Attrition.xls")

In [30]:
hr_data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [33]:
# Increase Monthly Income by 10%
hr_data.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [34]:
hr_data['MonthlyIncome']

0       5993
1       5130
2       2090
3       2909
4       3468
        ...
1465    2571
1466    9991
1467    6142
1468    5390
1469    4404
Name: MonthlyIncome, Length: 1470, dtype: int64

In [7]:
def increase_monthly_income(hr_data):
    hr_data['MonthlyIncome'] = hr_data['MonthlyIncome'] * 0.1
    return hr_data

In [52]:
hr_data = (hr_data.pipe(Increase_monthly_income))

In [54]:
hr_data['MonthlyIncome']

0       599.3
1       513.0
2       209.0
3       290.9
4       346.8
        ...
1465    257.1
1466    999.1
1467    614.2
1468    539.0
1469    440.4
Name: MonthlyIncome, Length: 1470, dtype: float64

In [5]:
def check_senior(hr_data):
    hr_data['IsSenior'] = hr_data["Age"].apply(lambda x:"Yes" if x > 40 else "No")
    return hr_data

In [6]:
def income_grade(hr_data):
    hr_data['income_grade'] = hr_data['MonthlyIncome'].apply(lambda x:'A' if x>5000 else 'B' if x>7000 else 'C')
    return hr_data

In [8]:
hr_data = increase_monthly_income(hr_data)
hr_data = check_senior(hr_data)
hr_data = income_grade(hr_data)

In [9]:
hr_data[['Age','MonthlyIncome','IsSenior','income_grade']].head()

   Age  MonthlyIncome IsSenior income_grade
0   41          599.3      Yes            C
1   49          513.0      Yes            C
2   37          209.0       No            C
3   33          290.9       No            C
4   27          346.8       No            C